cylinder/blockmesh/150ms/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.01/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(

    oversetFaces
    {
        type            overset;
        nFaces          0;
        startFace       31929;
    }

    back
    {
        type            empty;
        nFaces          15376;
        startFace       31929;
    }
    out
    {
        type            patch;
        physicalType    patch;
        nFaces          124;
        startFace       47305;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          124;
        startFace       47429;
    }
    in
    {
        type            patch;
        physicalType    patch;
        nFaces          124;
        startFace       47553;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          124;
        startFace       47677;
    }
    front
    {
        type            empty;
        nFaces          15376;
        startFace       47801;
    }
    sides
    {
        type            empty;
        nFaces          1500;
        startFace       63177;
    }
    wall
    {
        type            patch;
        nFaces          75;
        startFace       64677;
    }
    cylinder
    {
        type            patch;
        nFaces          75;
        startFace       64752;
    }
)

// ************************************************************************* //
