cylinder/blockmesh/150ms/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16126
(
(150.05534 -5.2595433e-05 0)
(150.05566 -0.0001580765 0)
(150.05629 -0.00026442906 0)
(150.05725 -0.00037223859 0)
(150.05853 -0.00048209785 0)
(150.06014 -0.00059460832 0)
(150.0621 -0.00071038469 0)
(150.06441 -0.00083005601 0)
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   true;
        conservativeCorrection false;
        setHoleCellValue yes;
        holeCellValue   (0 0 0);
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    in
    {
        type            fixedValue;
        value           uniform (150 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    sides
    {
        type            empty;
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
