cylinder/blockmesh/150ms/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16126
(
0.0006685085
0.0020093457
0.0033616562
0.0047331591
0.0061316794
0.0075651906
0.0090418589
0.010570087
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   true;
        conservativeCorrection true;
        setHoleCellValue yes;
        holeCellValue   0;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    in
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    sides
    {
        type            empty;
    }
    wall
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
