cylinder/blockmesh/150ms/0/divFlux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      divFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
16126
(
-8.8910551e-13
-8.4524362e-09
-1.652622e-08
-8.2878771e-09
-2.9284928e-08
3.4907895e-08
-3.5723009e-08
2.6518671e-08
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   false;
        conservativeCorrection false;
        setHoleCellValue false;
        holeCellValue   0;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    in
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    sides
    {
        type            empty;
    }
    wall
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
