cylinder/blockmesh/150ms/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
31929
(
-0.048404968
5.0898704e-08
-0.048405121
1.5297759e-07
-0.048405377
2.5589858e-07
-0.048405737
3.6023166e-07
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            calculated;
        value           nonuniform List<scalar> 
124
(
0.048404917
0.048404872
0.048404811
0.048404646
0.048404466
0.048404242
0.048404005
0.048403664
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    in
    {
        type            calculated;
        value           nonuniform List<scalar> 
124
(
-0.04838709
-0.04838709
-0.04838712
-0.04838709
-0.04838709
-0.04838709
-0.04838712
-0.04838709
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    sides
    {
        type            empty;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
-0.0602484
-0.0598212
-0.0589884
-0.0577272
-0.0560646
-0.0540114
-0.051579
-0.0487878
...
)
;
    }
}


// ************************************************************************* //
